xacml-ws/Reques1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xacml-context="urn:oasis:names:tc:xacml:2.0:context:schema:os">
   <soapenv:Header/>
   <soapenv:Body>
      <xacml-context:Request>

	<!-- A TVE subject token representing Access and Intermediary subjects 
	
	<xacml-context:Subject SubjectCategory="urn:oasis:names:tc:xacml:1.0:subject-category:access-subject">
            <xacml-context:Attribute AttributeId="urn:tve:names:tc:xacml:1.0:subject:subject-token" 
             DataType="http://www.w3.org/2001/XMLSchema#base64Binary">
               <xacml-context:AttributeValue>==AABABSABSBSBABAB ..... AKAKA</xacml-context:AttributeValue>
            </xacml-context:Attribute>  
        </xacml-context:Subject>

        -->
	
	<!--- Begin decoded subject token -->

	<!-- 
	     Intermediary subject will be decoded from TVE spec subject-token.
	     Intermediary subject represents an identity of TVE provider requesting
	     authorization decision for an access subject
        -->

	 <xacml-context:Subject SubjectCategory="urn:oasis:names:tc:xacml:1.0:subject-category:intermediary-subject">
            <xacml-context:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:subject:subject-id" 
		DataType="http://www.w3.org/2001/XMLSchema#string">
               <xacml-context:AttributeValue>tbs</xacml-context:AttributeValue>
            </xacml-context:Attribute>
         </xacml-context:Subject>

	<!--- Access subject will be decoded from TVE spec subject-token -->  

        <xacml-context:Subject SubjectCategory="urn:oasis:names:tc:xacml:1.0:subject-category:access-subject">
            <xacml-context:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:subject:subject-id" DataType="urn:oasis:names:tc:xacml:1.0:data-type:rfc822Name">
               <xacml-context:AttributeValue>test@comcast.net</xacml-context:AttributeValue>
            </xacml-context:Attribute>
	   <!-- 
               Subscriber content rating attributes will not be included in production request.
               They are used in this example to test XACML policies related to MPAA & V-Chip content
	       ratings and will be resolved from subscriber parental control settings
            -->	
	   <xacml-context:Attribute AttributeId="urn:comcast:names:1.0:subscriber:pc:ratings:v-chip" 
		DataType="http://www.w3.org/2001/XMLSchema#string">
               <xacml-context:AttributeValue>TV-G</xacml-context:AttributeValue>
           </xacml-context:Attribute>
	   <xacml-context:Attribute AttributeId="urn:comcast:names:1.0:subscriber:pc:ratings:mpaa" 
		DataType="http://www.w3.org/2001/XMLSchema#string">
               <xacml-context:AttributeValue>PG</xacml-context:AttributeValue>
           </xacml-context:Attribute>
        </xacml-context:Subject>
	
	<!--- End decoded subject token -->

	<!-- A TV show with TV-MA rating will result in "Permit" -->

         <xacml-context:Resource>
            <xacml-context:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:resource:resource-id" DataType="http://www.w3.org/2001/XMLSchema#anyURI">
               <xacml-context:AttributeValue>http://www.tbs.com/tv/tv-show</xacml-context:AttributeValue>
            </xacml-context:Attribute>
	    <xacml-context:Attribute AttributeId="urn:v-chip" DataType="http://www.w3.org/2001/XMLSchema#string">
               <xacml-context:AttributeValue>TV-MA</xacml-context:AttributeValue>
            </xacml-context:Attribute>
	    <xacml-context:Action>
               <xacml-context:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:action:action-id" DataType="http://www.w3.org/2001/XMLSchema#string">
                  <xacml-context:AttributeValue>view</xacml-context:AttributeValue>
               </xacml-context:Attribute>
            </xacml-context:Action>
         </xacml-context:Resource>

	<!-- PG13 movie will result in "Deny" because subscriber MPAA rating threshold is PG -->

	<xacml-context:Resource>
            <xacml-context:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:resource:resource-id" DataType="http://www.w3.org/2001/XMLSchema#anyURI">
               <xacml-context:AttributeValue>http://www.tbs.com/movies/movie</xacml-context:AttributeValue>
            </xacml-context:Attribute>
	    <xacml-context:Attribute AttributeId="urn:mpaa" 
		DataType="http://www.w3.org/2001/XMLSchema#string">
               <xacml-context:AttributeValue>PG13</xacml-context:AttributeValue>
            </xacml-context:Attribute>  
         </xacml-context:Resource>

	<!-- Resource without rating scheme will not be checked for parental controls, decision "Permit" -->

	<xacml-context:Resource>
            <xacml-context:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:resource:resource-id" DataType="http://www.w3.org/2001/XMLSchema#anyURI">
               <xacml-context:AttributeValue>http://www.tbs.com/movies/movie2</xacml-context:AttributeValue>
            </xacml-context:Attribute>
         </xacml-context:Resource>
         <xacml-context:Action>
            <xacml-context:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:action:action-id" DataType="http://www.w3.org/2001/XMLSchema#string">
               <xacml-context:AttributeValue>view</xacml-context:AttributeValue>
            </xacml-context:Attribute>
         </xacml-context:Action>
         <xacml-context:Environment>
	</xacml-context:Environment>
      </xacml-context:Request>
   </soapenv:Body>
</soapenv:Envelope>
